Revit 2025 API
BeamSystemJustifyType Enumeration
Describes the justify method of beamsystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BeamSystemJustifyType
Public Enumeration BeamSystemJustifyType
public enum class BeamSystemJustifyType
type BeamSystemJustifyType
Members
Member name | Value | Description
Center | 1 | Center.
End | 2 | End.
Beginning | 3 | Beginning.
DirectionLine | 4 | DirectionLine.
See Also
Reference
Autodesk.Revit.DB Namespace